[{"id":297489,"title":"Re: What happened to more cowbell?","text":"[quote=&quot;joeyluck&quot;:38jv821b]It was an April Fool's Day limited time offer.\nMaybe it will make another appearance this upcoming April?[/quote:38jv821b]\nlol that's funny because I am using it like it wasn't a joke.","user":"Advanced Suite","userId":7732,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297489#p297489"},{"id":297488,"title":"Re: CV - Do you use it? I don't.","text":"[quote=&quot;normen&quot;:38k7691s]Writing music and making patches are fundamentally different things really.. Thats why most (pop/rock) people write their songs using just an acoustic guitar and their voice - not by recording each track for the final arrangement and figuring out the guitar amp sounds right away.\n\nSo theres two sides to this - actually three. One is writing music - you'll just pull up some presets and go about playing - making a song. Then theres arrangement - you decide on actual patches for the final mix, tweak the sound and even make some CV patches here and there to achieve some goal, like the vibrato you alluded to or gating effects - whatever.\n\nBut aside of that theres also making completely new sound patches or devices/combinators that create some effect - I guess even as a musician solely writing songs you appreciate some of the cool ReFills with synth sounds or sampler sounds. Thats where the whole routing and CV thing really shines. Doesn't have much to do with writing songs in the first place though <!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->[/quote:38k7691s]\n\n\nYES! And while this is so very true, with the popularisation of electronic music, the traditional approach to composition has shifted to what is usually referred to as 'music production', where tweaking electronic gear (and Reason certainly is a playground for that) equals the good old doodling on a guitar or piano to come up with a pop song idea. \nAnd just as before it would have been hella difficult to evolve from a cool riff into a whole structured song, and even better, bringing that into the following stages of production, now each of us probably has tons of saved sessions with some cool beat or whatever <!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->\n\nBut speaking of CV: not using CV in Reason is like not using Ableton's session view (clips). <!-- s:puf_smile: --><img src=\"{SMILIES_PATH}/Smile.gif\" alt=\":puf_smile:\" title=\"PUF Smile\" /><!-- s:puf_smile: --> And by all means I don't judge that negatively at all. In fact I think for the most part I may be one of those people myself..","user":"Vince-Noir-99","userId":7157,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297488#p297488"},{"id":297487,"title":"Re: Burning through the Bankroll","text":"[quote=&quot;jayhosking&quot;:1kad2od9]For what it's worth, Reason 9 comes with a fantastic set of new features. It may seem minor, but the update to the factory sounds is alone worth the price, especially with your 20% discount.[/quote:1kad2od9]\n\nYeah, it's worth it. I would upgrade before getting more REs.","user":"ejanuska","userId":8039,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297487#p297487"},{"id":297486,"title":"Re: How to make this weird hoover variant?","text":"<!-- m --><a class=\"postlink\" href=\"https://techno-dads.com/2011/09/05/dad-noise-the-hoover/\">https://techno-dads.com/2011/09/05/dad- ... he-hoover/</a><!-- m -->\n\nsome history lessons right there.... just spent the morning hunting this down, thought it was called Mentasm (right) or Phantasm (wrong, but not far off lol)\n\nSecond insight.... <!-- m --><a class=\"postlink\" href=\"https://www.dogsonacid.com/threads/tutorial-hoover-synthesis.356821/\">https://www.dogsonacid.com/threads/tuto ... is.356821/</a><!-- m -->","user":"LABONERECORDINGS","userId":5300,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297486#p297486"},{"id":297485,"title":"Re: Do you use Reason for things other than music/songwriting? Let's talk!","text":"I use it to impress the ladies. When they see those SSL mixer channels all lined up on my 12&quot;&quot; monitor they're hooked.\nWhen I show them the rack its a done deal.","user":"ejanuska","userId":8039,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297485#p297485"},{"id":297484,"title":"Re: Subtractor Filter Movement?","text":"[quote=&quot;ravisoni&quot;:1oaefqno]Movement.zip\nCould somebody explain what's really happening in here? I started doodling trying to understand subtractor, and I notice that even without any LFOs or other things, there's this evolving sound (almost like the new note player in Reason 9) without me having twiddled enough knobs. While playing a chord, what's causing that 1) evolving movement behavior, 2) radio switching sound when you release they controller keys?\nThanks for any help![/quote:1oaefqno]\n\nIs this your patch? You've added a huge filter sweep (not the default sweep as was suggested) with a depth (amount) of 74 - is that what you're talking about? Once the sweep reaches the top, it stays there so any &quot;evolving&quot; you're hearing is the chord's fundamentals &quot;beating&quot; against each others:\n<!-- m --><a class=\"postlink\" href=\"https://en.wikipedia.org/wiki/Beat_(acoustics\">https://en.wikipedia.org/wiki/Beat_(acoustics</a><!-- m -->)\n\nIf you play only a single note, there is no &quot;evolving&quot; sound, right?\n\nAs for the release, I'm guessing what you're hearing is the filter being swept all the way back down over an extremely short period of time (filter release time = 0). \n\nThat's all I got.\n<!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->","user":"selig","userId":5179,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297484#p297484"},{"id":297483,"title":"Re: CV - Do you use it? I don't.","text":"CV is huge for me, it is something special that sets Reason apart.\n\n[quote=&quot;stfual&quot;:10p4nf07]Visualising what is actually going on is the biggest problem for me . It would be great if there was option to see the knobs moving.  [/quote:10p4nf07]\n\nAlternate solution is to get a CV analyzer to see what is going on. There are free ones, like the CVA-7 which is nice. \n\nYou can breathe new life into an old synth by using CV to send envelopes and LFOs from various sources to other synths . The stock synth REs have lots of great envelope sources and oscillators. The best part is that you can't fry any components by plugging into the wrong jack, so go nuts and don't worry.\n\nThe Pulsar RE is a great place to start for using LFOs, and it has an envelope generator on it also.\n\nWhen your're ready, the PSQ-1684 awaits.","user":"ejanuska","userId":8039,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297483#p297483"},{"id":297482,"title":"Re: (EDM) &quot;If You Say So&quot;","text":"[quote=&quot;Voyager&quot;:3b5t0rps]if not intended i feel that you have too much instruments on the center. You should try to make some panning, create some separation between instruments to get a better stereo imaging.[/quote:3b5t0rps]\n\nI used to do this more than recently, it was intended. I like to make my ish more monoish and dry nowdays. But I may give it a try and see if it would sound better. Thanks for the feedback!  <!-- s:puf_wink: --><img src=\"{SMILIES_PATH}/Wink.gif\" alt=\":puf_wink:\" title=\"PUF Wink\" /><!-- s:puf_wink: -->","user":"deepndark","userId":5318,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297482#p297482"},{"id":297481,"title":"Re: Mastering the Master Compressor","text":"[quote=&quot;Voyager&quot;:16yyful3][quote=&quot;selig&quot;:16yyful3]Dither is only added when you reduce bit depth. For example, once you reduce bit depth from 24 to 16 (and add dither), the only reason to add dither again would be to reduce bit depth further, which is not common at all![/quote:16yyful3]\n\nSure, but you agree that you're going to reduce bit depth only on a mastered file track right ? I mean i see no reason to add dither when you're done with your mixing and you plan to send it to a third party for mastering, agree ? In short terms what i mean is that you apply dither ( if needed ) to a mastered file track only.\n\n[quote=&quot;selig&quot;:16yyful3]The main reason why I put Ozone after the Master Outputs is because I'm using the Master Insert &quot;PRE COMPRESSOR&quot; for my side-chain filter trick. The OTHER reason is dither.[/quote:16yyful3]\n\nSo you mean that the dither should always comes after the bus compressor ?\n\n[quote=&quot;selig&quot;:16yyful3]There's also the fade out issue, for which there are two schools of thought. One is that you should fade out at the mix stage, and then master with the fade in place. The possible issue here is that as you fade, the amount of limiting will change, which may or may not be something you like. If you're doing a ton of limiting this may be more of an issue. But it's also probably the way most records were faded in the early days. The other school of thought is that you should limit first, then fade out after the limiter (but before adding dither), so that the &quot;sound&quot; of the limiting doesn't change as you fade. This has never bothered me, so I take the first approach because it's less of a headache to setup properly! If I was to use the second approach I'd use two Ozones, with a Selig Gain between them for the fade, using the first Ozone for limiting and the second for dither. This works with other limiters too, I'm just using Ozone as an example since it's what I'm using presently. \n<!-- s:) --><img src=\"{SMILIES_PATH}/icon_e_smile.gif\" alt=\":)\" title=\"Smile\" /><!-- s:) -->[/quote:16yyful3]\n\nI never use fade out, but as usual your bring very interesting points  <!-- s:thumbs_up: --><img src=\"{SMILIES_PATH}/Thumbs up.gif\" alt=\":thumbs_up:\" title=\"Thumbs up\" /><!-- s:thumbs_up: -->[/quote:16yyful3]\n\nTo clarify: Adding dither is done to deal with bit depth reduction. If you reduce bit depth, you can choose to add dither. If you're not reducing bit depth, don't add dither. None of the other points are relevant when discussing adding dither or not. Exporting at 24 bits for further processing, don't add dither. Exporting at 16 bits for any reason, add dither - but you don't HAVE to add dither when reducing bit depth, it's optional.\n\nBetter if I state it this way: IF your master fader always stays at 0 dB, you can add dither BEFORE the master fader. If it's anywhere else, you need to add dither AFTER the master fader.\n\n\n\nSent from my iPad using Tapatalk","user":"selig","userId":5179,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297481#p297481"},{"id":297480,"title":"Re: Old features that you mention only recently","text":"Took me a while to realize that you can click and drag to change the tempo on the transport, velocity and such on note event.","user":"ejanuska","userId":8039,"postUrl":"https://forum.reasontalk.com/viewtopic.php?p=297480#p297480"}]